frontend/controllers/ProfileController.php

	protected function findModel($id)
	{
		if (($model = Profile::findOne($id)) !== null) {
---
SELECT * FROM `profile` WHERE `id`='1'