frontend/controllers/SiteController.php

SELECT COUNT(*) FROM `post`
SELECT * FROM `post` LIMIT 10 OFFSET 10
---
    public function actionIndex()
    {

        //$sql = 'SELECT * FROM post ORDER BY id DESC';

        //$query = Post::findBySql($sql);
        $query = Post::find();

        $countQuery = clone $query;
        $pages = new Pagination(['totalCount' => $countQuery->count(), 'defaultPageSize' => 10]);
        $models = $query->offset($pages->offset)
        ->limit($pages->limit)
        ->all();