frontend/views/layouts/main.php

    } else {
        $menuItems[]=
        ['label' => 'Post', 'url' => ['/post/index']];
        $menuItems[] = [
            //'label' => 'Logout (' . Yii::$app->user->identity->username . ')',
            'label' => 'Logout (' . Yii::$app->user->identity->profile->first_name . ')',
            'url' => ['/site/logout'],
            'linkOptions' => ['data-method' => 'post']
        ];
---
SELECT * FROM `profile` WHERE `user_id`=1